Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.execution.planning.fallbackFormat
source: Understand the question within %1$@ and retrieve around "%2$@".
ar: افهم السؤال ضمن %1$@ واسترجع حول "%2$@".
de: Verstehe die Frage innerhalb von %1$@ und rufe Informationen zu „%2$@“ ab.
es: Comprender la pregunta dentro de %1$@ y recuperar en torno a "%2$@".
fr: Comprendre la question dans %1$@ et récupérer autour de "%2$@".
id: Pahami pertanyaan dalam %1$@ dan ambil sekitar "%2$@".
it: Comprendi la domanda all'interno di %1$@ e recupera intorno a "%2$@".
ja: %1$@ 内で質問を理解し、「%2$@」に関する情報を取得します。
ko: %1$@ 내에서 질문을 이해하고 "%2$@"에 대해 검색합니다.
nl: Begrijp de vraag binnen %1$@ en haal informatie op rond "%2$@".
pl: Zrozum pytanie w ramach %1$@ i pobierz informacje wokół „%2$@”.
pt_br: Entenda a pergunta dentro de %1$@ e recupere em torno de "%2$@".
ru: Понять вопрос в рамках %1$@ и найти информацию по «%2$@».
tr: Soruyu %1$@ içinde anlayın ve "%2$@" ile ilgili bilgileri alın.
uk: Зрозуміти запитання в межах %1$@ і знайти за "%2$@".
vi: Hiểu câu hỏi trong %1$@ và truy xuất xung quanh "%2$@".
zh_hans: 在%1$@范围内理解问题，并围绕“%2$@”检索。
zh_hant: 在 %1$@ 範圍內理解問題，並圍繞「%2$@」檢索。

# rag.workspace.execution.planning.summaryFormat
source: Planned query: %@
ar: الاستعلام المخطط: %@
de: Geplante Abfrage: %@
es: Consulta planificada: %@
fr: Requête planifiée : %@
id: Kueri yang direncanakan: %@
it: Query pianificata: %@
ja: 計画されたクエリ: %@
ko: 계획된 쿼리: %@
nl: Geplande query: %@
pl: Zaplanowane zapytanie: %@
pt_br: Consulta planejada: %@
ru: Спланированный запрос: %@
tr: Planlanan sorgu: %@
uk: Запланований запит: %@
vi: Truy vấn đã lập kế hoạch: %@
zh_hans: 已规划检索：%@
zh_hant: 已規劃檢索：%@

# rag.workspace.execution.planning.title
source: Query planning
ar: تخطيط الاستعلام
de: Abfrageplanung
es: Planificación de consulta
fr: Planification de la requête
id: Perencanaan kueri
it: Pianificazione query
ja: クエリ計画
ko: 쿼리 계획
pl: Planowanie zapytania
pt_br: Planejamento de consulta
ru: Планирование запроса
tr: Sorgu planlama
uk: Планування запиту
vi: Lập kế hoạch truy vấn
zh_hans: 查询规划
zh_hant: 查詢規劃

# rag.workspace.execution.reasoning.answer.title
source: Think
ar: فكّر
de: Denken
es: Pensar
fr: Réfléchir
id: Pikir
it: Pensa
ja: 思考
ko: 생각
nl: Denk
pl: Myśl
pt_br: Pensar
ru: Думать
tr: Düşün
uk: Думати
vi: Suy nghĩ
zh_hans: 思考
zh_hant: 思考

# rag.workspace.execution.reasoning.planning.title
source: Think
ar: فكّر
de: Denken
es: Pensar
fr: Réfléchir
id: Pikir
it: Pensa
ja: 思考
ko: 생각
nl: Denk
pl: Myśl
pt_br: Pensar
ru: Думать
tr: Düşün
uk: Думати
vi: Suy nghĩ
zh_hans: 思考
zh_hant: 思考

# rag.workspace.execution.remote.cache
source: Cache (no network request)
ar: ذاكرة التخزين المؤقت (بدون طلب شبكة)
de: Cache (keine Netzwerkanfrage)
es: Caché (sin solicitud de red)
fr: Cache (aucune requête réseau)
id: Cache (tanpa permintaan jaringan)
it: Cache (nessuna richiesta di rete)
ja: キャッシュ（ネットワークリクエストなし）
ko: 캐시 (네트워크 요청 없음)
nl: Cache (geen netwerkverzoek)
pl: Pamięć podręczna (bez żądania sieciowego)
pt_br: Cache (sem solicitação de rede)
ru: Кэш (без сетевого запроса)
tr: Önbellek (ağ isteği yok)
uk: Кеш (без мережевого запиту)
vi: Bộ nhớ đệm (không có yêu cầu mạng)
zh_hans: 缓存命中（未发起网络请求）
zh_hant: 快取命中（未發起網路請求）

# rag.workspace.execution.remote.configureExternalSearch
source: Configure External Search
ar: تكوين البحث الخارجي
de: Externe Suche konfigurieren
es: Configurar búsqueda externa
fr: Configurer la recherche externe
id: Konfigurasi Pencarian Eksternal
it: Configura Ricerca Esterna
ja: 外部検索を設定
ko: 외부 검색 구성
nl: Externe zoekopdracht configureren
pl: Skonfiguruj wyszukiwanie zewnętrzne
pt_br: Configurar Pesquisa Externa
ru: Настроить внешний поиск
tr: Harici Aramayı Yapılandır
uk: Налаштувати зовнішній пошук
vi: Cấu hình Tìm kiếm bên ngoài
zh_hans: 配置网络搜索
zh_hant: 配置網路搜尋

# rag.workspace.execution.remote.endpoint
source: View request endpoint
ar: عرض نقطة نهاية الطلب
de: Anfrage-Endpunkt anzeigen
es: Ver endpoint de solicitud
fr: Voir le point de terminaison de la requête
id: Lihat titik akhir permintaan
it: Visualizza endpoint richiesta
ja: リクエストエンドポイントを表示
ko: 요청 엔드포인트 보기
nl: Verzoekeindpunt bekijken
pl: Zobacz punkt końcowy żądania
pt_br: Ver endpoint da solicitação
ru: Просмотреть конечную точку запроса
tr: İstek uç noktasını görüntüle
uk: Переглянути кінцеву точку запиту
vi: Xem điểm cuối yêu cầu
zh_hans: 查看请求 endpoint
zh_hant: 查看請求 endpoint

# rag.workspace.execution.remote.network
source: Network
ar: الشبكة
de: Netzwerk
es: Red
fr: Réseau
id: Jaringan
it: Rete
ja: ネットワーク
ko: 네트워크
nl: Netwerk
pl: Sieć
pt_br: Rede
ru: Сеть
tr: Ağ
uk: Мережа
vi: Mạng
zh_hans: 网络请求
zh_hant: 網路請求

# rag.workspace.execution.remote.progressFormat
source: Fetching online context: %1$lld of %2$lld
ar: جلب السياق عبر الإنترنت: %1$lld من %2$lld
de: Online-Kontext wird abgerufen: %1$lld von %2$lld
es: Obteniendo contexto en línea: %1$lld de %2$lld
fr: Récupération du contexte en ligne : %1$lld sur %2$lld
id: Mengambil konteks online: %1$lld dari %2$lld
it: Recupero contesto online: %1$lld di %2$lld
ja: オンラインコンテキストを取得中: %1$lld / %2$lld
ko: 온라인 컨텍스트 가져오는 중: %1$lld / %2$lld
nl: Online context ophalen: %1$lld van %2$lld
pl: Pobieranie kontekstu online: %1$lld z %2$lld
pt_br: Buscando contexto online: %1$lld de %2$lld
ru: Загрузка онлайн-контекста: %1$lld из %2$lld
tr: Çevrimiçi bağlam getiriliyor: %1$lld / %2$lld
uk: Отримання онлайн-контексту: %1$lld з %2$lld
vi: Đang tìm nạp ngữ cảnh trực tuyến: %1$lld trên %2$lld
zh_hans: 正在获取联网上下文：%1$lld / %2$lld
zh_hant: 正在取得聯網上下文：%1$lld / %2$lld

# rag.workspace.execution.remote.queryFormat
source: Query: %@
ar: الاستعلام: %@
de: Abfrage: %@
es: Consulta: %@
fr: Requête : %@
id: Kueri: %@
ja: クエリ: %@
ko: 쿼리: %@
pl: Zapytanie: %@
pt_br: Consulta: %@
ru: Запрос: %@
tr: Sorgu: %@
uk: Запит: %@
vi: Truy vấn: %@
zh_hans: 查询：%@
zh_hant: 查詢：%@

# rag.workspace.execution.remote.resultCountFormat
source: %lld results
ar: %lld نتيجة
de: %lld Ergebnisse
es: %lld resultados
fr: %lld résultats
id: %lld hasil
it: %lld risultati
ja: %lld 件の結果
ko: %lld개 결과
nl: %lld resultaten
pl: %lld wyników
pt_br: %lld resultados
ru: %lld результатов
tr: %lld sonuç
uk: %lld результатів
vi: %lld kết quả
zh_hans: %lld 条结果
zh_hant: %lld 條結果

# rag.workspace.execution.remote.status.empty
source: No results
ar: لا توجد نتائج
de: Keine Ergebnisse
es: Sin resultados
fr: Aucun résultat
id: Tidak ada hasil
it: Nessun risultato
ja: 結果なし
ko: 결과 없음
nl: Geen resultaten
pl: Brak wyników
pt_br: Sem resultados
ru: Нет результатов
tr: Sonuç yok
uk: Немає результатів
vi: Không có kết quả
zh_hans: 无结果
zh_hant: 無結果

# rag.workspace.execution.remote.status.failed
source: Failed
ar: فشل
de: Fehlgeschlagen
es: Fallido
fr: Échoué
id: Gagal
it: Fallito
ja: 失敗
ko: 실패
nl: Mislukt
pl: Niepowodzenie
pt_br: Falhou
ru: Ошибка
tr: Başarısız
uk: Помилка
vi: Thất bại
zh_hans: 失败
zh_hant: 失敗

# rag.workspace.execution.remote.status.pending
source: Pending
ar: قيد الانتظار
de: Ausstehend
es: Pendiente
fr: En attente
id: Tertunda
it: In attesa
ja: 保留中
ko: 대기 중
nl: In behandeling
pl: Oczekiwanie
pt_br: Pendente
ru: Ожидание
tr: Beklemede
uk: Очікування
vi: Đang chờ
zh_hans: 等待中
zh_hant: 等待中

# rag.workspace.execution.remote.status.running
source: Running
ar: قيد التشغيل
de: Wird ausgeführt
es: Ejecutando
fr: En cours
id: Berjalan
it: In esecuzione
ja: 実行中
ko: 실행 중
nl: Bezig
pl: Uruchomiono
pt_br: Em execução
ru: Выполняется
tr: Çalışıyor
uk: Виконується
vi: Đang chạy
zh_hans: 查询中
zh_hant: 查詢中

# rag.workspace.execution.remote.status.skipped
source: Skipped
ar: تم التخطي
de: Übersprungen
es: Omitido
fr: Ignoré
id: Dilewati
it: Saltato
ja: スキップ
ko: 건너뜀
nl: Overgeslagen
pl: Pominięto
pt_br: Ignorado
ru: Пропущено
tr: Atlandı
uk: Пропущено
vi: Đã bỏ qua
zh_hans: 已跳过
zh_hant: 已跳過

# rag.workspace.execution.remote.status.succeeded
source: Succeeded
ar: نجح
de: Erfolgreich
es: Exitoso
fr: Réussi
id: Berhasil
it: Riuscito
ja: 成功
ko: 성공
nl: Geslaagd
pl: Powodzenie
pt_br: Bem-sucedido
ru: Успешно
tr: Başarılı
uk: Успішно
vi: Thành công
zh_hans: 成功
zh_hant: 成功

# rag.workspace.execution.remote.summaryFormat
source: Fetched context from %lld sources
ar: تم جلب السياق من %lld مصدر
de: Kontext von %lld Quellen abgerufen
es: Contexto obtenido de %lld fuentes
fr: Contexte récupéré depuis %lld sources
id: Mengambil konteks dari %lld sumber
it: Contesto recuperato da %lld fonti
ja: %lld 個のソースからコンテキストを取得
ko: %lld개 소스에서 컨텍스트 가져옴
nl: Context opgehaald van %lld bronnen
pl: Pobrano kontekst z %lld źródeł
pt_br: Contexto obtido de %lld fontes
ru: Получен контекст из %lld источников
tr: %lld kaynaktan bağlam getirildi
uk: Отримано контекст із %lld джерел
vi: Đã tìm nạp ngữ cảnh từ %lld nguồn
zh_hans: 已从 %lld 个联网来源获取上下文
zh_hant: 已從 %lld 個聯網來源取得上下文

# rag.workspace.execution.remote.title
source: Search online
ar: البحث عبر الإنترنت
de: Online suchen
es: Buscar en línea
fr: Rechercher en ligne
id: Cari online
it: Cerca online
ja: オンライン検索
ko: 온라인 검색
nl: Online zoeken
pl: Szukaj online
pt_br: Pesquisar online
ru: Поиск в интернете
tr: Çevrimiçi ara
uk: Пошук в Інтернеті
vi: Tìm kiếm trực tuyến
zh_hans: 联网搜索
zh_hant: 聯網搜尋

# rag.workspace.execution.remoteSkipped
source: Skipped GitHub context as requested
ar: تم تخطي سياق GitHub كما هو مطلوب
de: GitHub-Kontext wie angefordert übersprungen
es: Contexto de GitHub omitido según lo solicitado
fr: Contexte GitHub ignoré comme demandé
id: Konteks GitHub dilewati sesuai permintaan
it: Contesto GitHub saltato come richiesto
ja: 要求によりGitHubコンテキストをスキップしました
ko: 요청에 따라 GitHub 컨텍스트 건너뜀
nl: GitHub-context overgeslagen zoals gevraagd
pl: Pominięto kontekst GitHub zgodnie z żądaniem
pt_br: Contexto do GitHub ignorado conforme solicitado
ru: Контекст GitHub пропущен по запросу
tr: İstendiği gibi GitHub bağlamı atlandı
uk: Контекст GitHub пропущено, як запитано
vi: Đã bỏ qua ngữ cảnh GitHub theo yêu cầu
zh_hans: 已按你的选择跳过 GitHub 上下文
zh_hant: 已按你的選擇跳過 GitHub 上下文

# rag.workspace.execution.repoContext.checkingCache
source: Checking the matching project-code cache
ar: التحقق من ذاكرة التخزين المؤقت لرمز المشروع المطابق
de: Überprüfe den Cache für passenden Projektcode
es: Verificando la caché de código del proyecto coincidente
fr: Vérification du cache de code de projet correspondant
id: Memeriksa cache kode proyek yang cocok
it: Verifica della cache del codice del progetto corrispondente
ja: 一致するプロジェクトコードのキャッシュを確認中
ko: 일치하는 프로젝트 코드 캐시 확인 중
nl: Bijpassende projectcode-cache controleren
pl: Sprawdzanie pamięci podręcznej pasującego kodu projektu
pt_br: Verificando o cache de código do projeto correspondente
ru: Проверка кэша соответствующего кода проекта
tr: Eşleşen proje kodu önbelleği kontrol ediliyor
uk: Перевірка кешу відповідного коду проєкту
vi: Đang kiểm tra bộ nhớ đệm mã dự án phù hợp
zh_hans: 正在检查匹配的项目代码缓存
zh_hant: 正在檢查匹配的專案程式碼快取

# rag.workspace.execution.repoContext.completed
source: Project code is ready
ar: رمز المشروع جاهز
de: Projektcode ist bereit
es: El código del proyecto está listo
fr: Le code du projet est prêt
id: Kode proyek siap
it: Il codice del progetto è pronto
ja: プロジェクトコードの準備が完了しました
ko: 프로젝트 코드 준비 완료
nl: Projectcode is gereed
pl: Kod projektu jest gotowy
pt_br: O código do projeto está pronto
ru: Код проекта готов
tr: Proje kodu hazır
uk: Код проєкту готовий
vi: Mã dự án đã sẵn sàng
zh_hans: 项目代码已就绪
zh_hant: 專案程式碼已就緒

# rag.workspace.execution.repoContext.degraded
source: Project code was unavailable; continued without it
ar: رمز المشروع غير متاح؛ تمت المتابعة بدونه
de: Projektcode war nicht verfügbar; Fortsetzung ohne ihn
es: El código del proyecto no estaba disponible; se continuó sin él
fr: Le code du projet était indisponible ; poursuite sans
id: Kode proyek tidak tersedia; dilanjutkan tanpa itu
it: Il codice del progetto non era disponibile; continuato senza
ja: プロジェクトコードが利用できなかったため、なしで続行しました
ko: 프로젝트 코드를 사용할 수 없어서 계속 진행하지 않음
nl: Projectcode was niet beschikbaar; doorgegaan zonder
pl: Kod projektu był niedostępny; kontynuowano bez niego
pt_br: O código do projeto estava indisponível; continuou sem ele
ru: Код проекта был недоступен; продолжено без него
tr: Proje kodu kullanılamadı; onsuz devam edildi
uk: Код проєкту був недоступний; продовжено без нього
vi: Mã dự án không khả dụng; tiếp tục mà không có nó
zh_hans: 项目代码不可用，已降级继续
zh_hant: 專案程式碼不可用，已降級繼續

# rag.workspace.execution.repoContext.disabled
source: Project code is disabled in Settings
ar: رمز المشروع معطل في الإعدادات
de: Projektcode ist in den Einstellungen deaktiviert
es: El código del proyecto está deshabilitado en Configuración
fr: Le code du projet est désactivé dans les réglages
id: Kode proyek dinonaktifkan di Pengaturan
it: Il codice del progetto è disabilitato in Impostazioni
ja: 設定でプロジェクトコードが無効になっています
ko: 설정에서 프로젝트 코드가 비활성화됨
nl: Projectcode is uitgeschakeld in Instellingen
pl: Kod projektu jest wyłączony w ustawieniach
pt_br: O código do projeto está desativado nos Ajustes
ru: Код проекта отключён в настройках
tr: Proje kodu Ayarlar'da devre dışı
uk: Код проєкту вимкнено в налаштуваннях
vi: Mã dự án bị tắt trong Cài đặt
zh_hans: 设置中已关闭项目代码
zh_hant: 設定中已關閉專案程式碼

# rag.workspace.execution.repoContext.downloadingArchive
source: Downloading the source archive
ar: جارٍ تنزيل أرشيف المصدر
de: Quellarchiv wird heruntergeladen
es: Descargando el archivo fuente
fr: Téléchargement de l'archive source
id: Mengunduh arsip sumber
it: Scaricamento dell'archivio sorgente
ja: ソースアーカイブをダウンロード中
ko: 소스 아카이브 다운로드 중
nl: Bronarchief downloaden
pl: Pobieranie archiwum źródłowego
pt_br: Baixando o arquivo de origem
ru: Загрузка архива исходного кода
tr: Kaynak arşivi indiriliyor
uk: Завантаження архіву вихідного коду
vi: Đang tải xuống kho lưu trữ nguồn
zh_hans: 正在下载源码归档
zh_hant: 正在下載原始碼壓縮檔

# rag.workspace.execution.repoContext.packingContext
source: Packing project-code XML
ar: تعبئة XML كود المشروع
de: Projektcode-XML wird gepackt
es: Empaquetando XML del código del proyecto
fr: Empaquetage du XML du code projet
id: Mengemas XML kode proyek
it: Pacchettizzazione del codice progetto in XML
ja: プロジェクトコードのXMLをパッキング中
ko: 프로젝트 코드 XML 패킹 중
nl: Projectcode-XML inpakken
pl: Pakowanie kodu projektu do XML
pt_br: Empacotando XML do código do projeto
ru: Упаковка XML-кода проекта
tr: Proje kodu XML paketleniyor
uk: Пакування XML коду проекту
vi: Đang đóng gói XML mã dự án
zh_hans: 正在生成项目代码 XML
zh_hant: 正在產生專案程式碼 XML

# rag.workspace.execution.repoContext.projecting
source: Fitting XML to the model context window
ar: ملاءمة XML لنافذة سياق النموذج
de: XML an das Modellkontextfenster anpassen
es: Ajustando XML a la ventana de contexto del modelo
fr: Ajustement du XML à la fenêtre de contexte du modèle
id: Menyesuaikan XML ke jendela konteks model
it: Adattamento dell'XML alla finestra di contesto del modello
ja: XMLをモデルのコンテキストウィンドウに適合中
ko: XML을 모델 컨텍스트 창에 맞추는 중
nl: XML aanpassen aan modelcontextvenster
pl: Dopasowywanie XML do okna kontekstu modelu
pt_br: Ajustando XML à janela de contexto do modelo
ru: Подгонка XML под окно контекста модели
tr: XML model bağlam penceresine uyarlanıyor
uk: Підгонка XML під вікно контексту моделі
vi: Điều chỉnh XML cho phù hợp với cửa sổ ngữ cảnh mô hình
zh_hans: 正在按模型窗口做窗口适配
zh_hant: 正在按模型視窗做視窗適配

# rag.workspace.execution.repoContext.resolvingBranch
source: Resolving the repository branch
ar: تحديد فرع المستودع
de: Repository-Branch wird aufgelöst
es: Resolviendo la rama del repositorio
fr: Résolution de la branche du dépôt
id: Menyelesaikan cabang repositori
it: Risoluzione del ramo del repository
ja: リポジトリブランチを解決中
ko: 저장소 브랜치 확인 중
nl: Repository-tak oplossen
pl: Rozpoznawanie gałęzi repozytorium
pt_br: Resolvendo o branch do repositório
ru: Определение ветки репозитория
tr: Depo dalı çözümleniyor
uk: Визначення гілки репозиторію
vi: Đang phân giải nhánh kho lưu trữ
zh_hans: 正在解析项目分支
zh_hant: 正在解析專案分支

# rag.workspace.execution.repoContext.title
source: Project code
ar: كود المشروع
de: Projektcode
es: Código del proyecto
fr: Code projet
id: Kode proyek
it: Codice progetto
ja: プロジェクトコード
ko: 프로젝트 코드
pl: Kod projektu
pt_br: Código do projeto
ru: Код проекта
tr: Proje kodu
uk: Код проекту
vi: Mã dự án
zh_hans: 项目代码
zh_hant: 專案程式碼

# rag.workspace.execution.repoContext.tokenDetailPrefix
source: Tokens:
ar: الرموز:
de: Token:
fr: Jetons :
id: Token:
it: Token:
ja: トークン:
ko: 토큰:
pl: Tokeny:
ru: Токены:
tr: Token:
uk: Токени:
vi: Token:

# rag.workspace.execution.repoContext.tokensFormat
source: Tokens: %lld
ar: الرموز: %lld
de: Token: %lld
fr: Jetons : %lld
id: Token: %lld
it: Token: %lld
ja: トークン: %lld
ko: 토큰: %lld
pl: Tokeny: %lld
ru: Токены: %lld
tr: Token: %lld
uk: Токени: %lld
vi: Token: %lld

# rag.workspace.execution.repoContext.xmlPreparedFormat
source: Generated project-code XML (%lld tokens)
ar: تم إنشاء XML كود المشروع (%lld رمزًا)
de: Projektcode-XML generiert (%lld Token)
es: XML del código del proyecto generado (%lld tokens)
fr: XML du code projet généré (%lld jetons)
id: XML kode proyek yang dihasilkan (%lld token)
it: XML del codice progetto generato (%lld token)
ja: 生成されたプロジェクトコードXML（%lld トークン）
ko: 생성된 프로젝트 코드 XML (%lld 토큰)
nl: Gegenereerde projectcode-XML (%lld tokens)
pl: Wygenerowano XML kodu projektu (%lld tokenów)
pt_br: XML do código do projeto gerado (%lld tokens)
ru: Сгенерирован XML-код проекта (%lld токенов)
tr: Oluşturulan proje kodu XML (%lld token)
uk: Згенеровано XML коду проекту (%lld токенів)
vi: Đã tạo XML mã dự án (%lld token)
zh_hans: 已生成项目代码 XML（%lld tokens）
zh_hant: 已產生專案程式碼 XML（%lld tokens）

# rag.workspace.execution.retrieval.candidatesFormat
source: Selected %lld candidate repositories from the knowledge base
ar: تم تحديد %lld مستودعًا مرشحًا من قاعدة المعرفة
de: %lld Kandidaten-Repositories aus der Wissensdatenbank ausgewählt
es: Se seleccionaron %lld repositorios candidatos de la base de conocimiento
fr: %lld dépôts candidats sélectionnés dans la base de connaissances
id: Memilih %lld repositori kandidat dari basis pengetahuan
it: Selezionati %lld repository candidati dalla knowledge base
ja: ナレッジベースから %lld 個の候補リポジトリを選択
ko: 지식 베이스에서 %lld개의 후보 저장소를 선택했습니다
nl: %lld kandidaatrepositories geselecteerd uit de kennisbank
pl: Wybrano %lld repozytoriów kandydujących z bazy wiedzy
pt_br: Selecionados %lld repositórios candidatos da base de conhecimento
ru: Выбрано %lld репозиториев-кандидатов из базы знаний
tr: Bilgi tabanından %lld aday depo seçildi
uk: Вибрано %lld кандидатів з бази знань
vi: Đã chọn %lld kho lưu trữ ứng viên từ cơ sở tri thức
zh_hans: 已从知识库筛出 %lld 个候选仓库
zh_hant: 已從知識庫篩出 %lld 個候選倉庫

# rag.workspace.execution.retrieval.evidencePackedFormat
source: Packed %1$lld hits into context for %2$lld repositories
ar: تم تعبئة %1$lld نتيجة في سياق %2$lld مستودعًا
de: %1$lld Treffer in Kontext für %2$lld Repositories gepackt
es: Se empaquetaron %1$lld resultados en contexto para %2$lld repositorios
fr: %1$lld résultats empaquetés dans le contexte pour %2$lld dépôts
id: Mengemas %1$lld hasil ke dalam konteks untuk %2$lld repositori
it: Confezionati %1$lld risultati in contesto per %2$lld repository
ja: %1$lld 件のヒットを %2$lld 個のリポジトリのコンテキストにパック
ko: %1$lld개의 적중 항목을 %2$lld개 저장소의 컨텍스트에 패킹했습니다
nl: %1$lld hits ingepakt in context voor %2$lld repositories
pl: Zapakowano %1$lld trafień do kontekstu dla %2$lld repozytoriów
pt_br: Empacotadas %1$lld ocorrências no contexto para %2$lld repositórios
ru: Упаковано %1$lld совпадений в контекст для %2$lld репозиториев
tr: %1$lld sonuç, %2$lld depo için bağlama paketlendi
uk: Упаковано %1$lld збігів у контекст для %2$lld репозиторіїв
vi: Đã đóng gói %1$lld kết quả vào ngữ cảnh cho %2$lld kho lưu trữ
zh_hans: 已将 %1$lld 条命中整理为 %2$lld 个仓库上下文
zh_hant: 已將 %1$lld 條命中整理為 %2$lld 個倉庫上下文

# rag.workspace.execution.retrieval.keywordCompletedFormat
source: Keyword search found %lld candidate chunks
ar: وجد البحث بالكلمات المفتاحية %lld مقطعًا مرشحًا
de: Schlüsselwortsuche fand %lld Kandidaten-Chunks
es: La búsqueda por palabras clave encontró %lld fragmentos candidatos
fr: La recherche par mot-clé a trouvé %lld fragments candidats
id: Pencarian kata kunci menemukan %lld potongan kandidat
it: Ricerca per parole chiave ha trovato %lld blocchi candidati
ja: キーワード検索で %lld 個の候補チャンクを発見
ko: 키워드 검색에서 %lld개의 후보 청크를 찾았습니다
nl: Trefwoordzoekopdracht vond %lld kandidaatfragmenten
pl: Wyszukiwanie słów kluczowych znalazło %lld kandydujących fragmentów
pt_br: Busca por palavra-chave encontrou %lld trechos candidatos
ru: Поиск по ключевым словам нашёл %lld фрагментов-кандидатов
tr: Anahtar kelime araması %lld aday parça buldu
uk: Пошук за ключовими словами знайшов %lld фрагментів-кандидатів
vi: Tìm kiếm từ khóa tìm thấy %lld đoạn ứng viên
zh_hans: 关键词检索命中 %lld 个候选分片
zh_hant: 關鍵詞檢索命中 %lld 個候選分片

# rag.workspace.execution.retrieval.keywordStarted
source: Searching indexed text by keyword
ar: البحث في النص المفهرس بالكلمة المفتاحية
de: Indizierten Text nach Schlüsselwort durchsuchen
es: Buscando en texto indexado por palabra clave
fr: Recherche dans le texte indexé par mot-clé
id: Mencari teks yang diindeks berdasarkan kata kunci
it: Ricerca nel testo indicizzato per parola chiave
ja: キーワードでインデックス済みテキストを検索中
ko: 색인된 텍스트를 키워드로 검색 중
nl: Doorzoek geïndexeerde tekst op trefwoord
pl: Przeszukiwanie indeksowanego tekstu według słów kluczowych
pt_br: Buscando texto indexado por palavra-chave
ru: Поиск по ключевым словам в проиндексированном тексте
tr: Dizine alınmış metin anahtar kelimeyle taranıyor
uk: Пошук за ключовими словами в індексованому тексті
vi: Đang tìm kiếm văn bản đã lập chỉ mục theo từ khóa
zh_hans: 正在按关键词检索已索引文本
zh_hant: 正在按關鍵詞檢索已索引文字

# rag.workspace.execution.retrieval.semanticCompletedFormat
source: Semantic search found %lld candidate chunks
ar: وجد البحث الدلالي %lld مقطعًا مرشحًا
de: Semantische Suche fand %lld Kandidaten-Chunks
es: La búsqueda semántica encontró %lld fragmentos candidatos
fr: La recherche sémantique a trouvé %lld fragments candidats
id: Pencarian semantik menemukan %lld potongan kandidat
it: Ricerca semantica ha trovato %lld blocchi candidati
ja: セマンティック検索で %lld 個の候補チャンクを発見
ko: 의미 검색에서 %lld개의 후보 청크를 찾았습니다
nl: Semantische zoekopdracht vond %lld kandidaatfragmenten
pl: Wyszukiwanie semantyczne znalazło %lld kandydujących fragmentów
pt_br: Busca semântica encontrou %lld trechos candidatos
ru: Семантический поиск нашёл %lld фрагментов-кандидатов
tr: Anlamsal arama %lld aday parça buldu
uk: Семантичний пошук знайшов %lld фрагментів-кандидатів
vi: Tìm kiếm ngữ nghĩa tìm thấy %lld đoạn ứng viên
zh_hans: 语义检索命中 %lld 个候选分片
zh_hant: 語義檢索命中 %lld 個候選分片

# rag.workspace.execution.retrieval.semanticStarted
source: Generating a query vector and matching semantics
ar: توليد متجه استعلام ومطابقة الدلالات
de: Abfragevektor generieren und Semantik abgleichen
es: Generando un vector de consulta y emparejando semántica
fr: Génération d'un vecteur de requête et correspondance sémantique
id: Menghasilkan vektor kueri dan mencocokkan semantik
it: Generazione di un vettore di query e corrispondenza semantica
ja: クエリベクトルを生成し、セマンティックマッチング中
ko: 쿼리 벡터 생성 및 의미 일치 중
nl: Queryvector genereren en semantiek matchen
pl: Generowanie wektora zapytania i dopasowywanie semantyczne
pt_br: Gerando vetor de consulta e combinando semânticas
ru: Генерация вектора запроса и сопоставление семантики
tr: Sorgu vektörü oluşturuluyor ve anlam eşlemesi yapılıyor
uk: Генерація вектора запиту та семантичне зіставлення
vi: Đang tạo vector truy vấn và đối sánh ngữ nghĩa
zh_hans: 正在生成查询向量并匹配语义
zh_hant: 正在產生查詢向量並匹配語義
